{
  "_name_or_path": "t5-base",
  "_num_labels": 2,
  "architectures": [
    "TFT5Model"
  ],
  "attention_probs_dropout_prob": 0.1,
  "d_ff": 2048,
  "d_kv": 64,
  "d_model": 768,
  "decoder_attention_heads": 12,
  "decoder_ffn_dim": 3072,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 12,
  "dense_act_fn": "gelu_new",
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "gated-gelu",
  "gradient_checkpointing": false,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "input_feeding": true,
  "is_encoder_decoder": true,
  "is_gated_act": true,
  "layer_norm_epsilon": 1e-06,
  "max_length": 1024,
  "model_type": "t5",
  "num_decoder_layers": 12,
  "num_heads": 12,
  "num_layers": 12,
  "num_tokens_to_add": 10000,
  "output_past": true,
  "pad_token_id": 0,
  "padding": "max_length",
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "return_tensors": "tf",
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "truncation": true,
  "use_cache": true,
  "vocab_size": 32128
}
